code_sweepdelay/newlog/stress-output20.log
******************** Stress Settings ********************
Command:
  Type: write
  Count: -1
  Duration: 30 SECONDS
  No Warmup: false
  Consistency Level: ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Sequence: 1..1000000
  Order: ARBITRARY
  Wrap: true
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 1
  Column Names: [C0]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=1
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V4
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [cassandra_a, cassandra_b, cassandra_c]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Pptions: {replication_factor=3}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  Thrift Port: 9160
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: WRITE
TokenRange:
  Wrap: false
  Split Factor: 1

Connected to cluster: TestCluster, max pending requests per connection 128, max connections per host 8
Datatacenter: datacenter1; Host: cassandra_c/172.19.0.4; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_b/172.19.0.3; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_a/172.19.0.2; Rack: rack1
Created keyspaces. Sleeping 3s for propagation.
Sleeping 2s...
Warming up WRITE with 150000 iterations...
Failed to connect over JMX; not collecting these stats
Running WRITE with 50 threads 30 seconds
Failed to connect over JMX; not collecting these stats
type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
total,          3086,    3086,    3086,    3086,    13.6,    20.3,    20.4,    20.4,    20.6,    20.6,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,          6741,    3655,    3655,    3655,    13.7,    20.3,    20.3,    20.4,    20.5,    21.2,    2.0,  0.05991,      0,      0,       0,       0,       0,       0
total,         10353,    3612,    3612,    3612,    13.8,    20.3,    20.3,    20.4,    20.6,    21.4,    3.0,  0.04346,      0,      0,       0,       0,       0,       0
total,         13959,    3606,    3606,    3606,    13.8,    20.3,    20.3,    20.4,    20.7,    21.1,    4.0,  0.03363,      0,      0,       0,       0,       0,       0
total,         17640,    3681,    3681,    3681,    13.6,    20.3,    20.3,    20.4,    20.5,    22.5,    5.0,  0.02841,      0,      0,       0,       0,       0,       0
total,         21265,    3625,    3625,    3625,    13.8,    20.3,    20.3,    20.4,    20.4,    20.7,    6.0,  0.02392,      0,      0,       0,       0,       0,       0
total,         24932,    3667,    3667,    3667,    13.6,    20.2,    20.3,    20.4,    20.4,    20.4,    7.0,  0.02088,      0,      0,       0,       0,       0,       0
total,         28522,    3590,    3590,    3590,    13.9,    20.2,    20.3,    20.4,    20.4,    20.7,    8.0,  0.01828,      0,      0,       0,       0,       0,       0
total,         32231,    3709,    3709,    3709,    13.5,    20.2,    20.3,    20.4,    20.4,    20.6,    9.0,  0.01670,      0,      0,       0,       0,       0,       0
total,         35899,    3668,    3668,    3668,    13.7,    20.2,    20.3,    20.4,    20.5,    23.2,   10.0,  0.01520,      0,      0,       0,       0,       0,       0
total,         39560,    3661,    3661,    3661,    13.7,    20.2,    20.3,    20.4,    20.5,    20.6,   11.0,  0.01389,      0,      0,       0,       0,       0,       0
total,         43317,    3757,    3757,    3757,    13.3,    20.3,    20.3,    20.4,    20.4,    25.4,   12.0,  0.01327,      0,      0,       0,       0,       0,       0
total,         46969,    3652,    3652,    3652,    13.7,    20.3,    20.3,    20.4,    20.5,    22.8,   13.0,  0.01228,      0,      0,       0,       0,       0,       0
total,         50647,    3678,    3678,    3678,    13.6,    20.2,    20.3,    20.4,    20.5,    20.9,   14.0,  0.01145,      0,      0,       0,       0,       0,       0
total,         54359,    3712,    3712,    3712,    13.5,    20.3,    20.3,    20.4,    20.5,    20.9,   15.0,  0.01079,      0,      0,       0,       0,       0,       0
total,         58050,    3691,    3691,    3691,    13.4,    20.3,    20.4,    20.8,    26.3,    26.5,   16.0,  0.01020,      0,      0,       0,       0,       0,       0
total,         61789,    3739,    3739,    3739,    13.4,    20.2,    20.3,    20.4,    20.4,    20.6,   17.0,  0.00973,      0,      0,       0,       0,       0,       0
total,         65402,    3613,    3613,    3613,    13.8,    20.3,    20.3,    20.4,    20.5,    26.1,   18.0,  0.00919,      0,      0,       0,       0,       0,       0
total,         69088,    3686,    3686,    3686,    13.6,    20.3,    20.3,    20.4,    20.5,    27.6,   19.0,  0.00876,      0,      0,       0,       0,       0,       0
total,         72750,    3662,    3662,    3662,    13.7,    20.2,    20.3,    20.4,    20.4,    24.4,   20.0,  0.00833,      0,      0,       0,       0,       0,       0
total,         76121,    3371,    3371,    3371,    13.7,    20.2,    20.3,    20.4,    24.0,    25.9,   21.0,  0.00860,      0,      0,       0,       0,       0,       0
total,         79761,    3640,    3640,    3640,    14.6,    20.3,    20.4,    71.7,   109.4,   116.5,   22.0,  0.00952,      0,      0,       0,       0,       0,       0
total,         83344,    3583,    3583,    3583,    13.9,    20.3,    20.4,    22.4,    77.1,    78.4,   23.0,  0.00928,      0,      0,       0,       0,       0,       0
total,         86995,    3651,    3651,    3651,    13.7,    20.3,    20.4,    20.4,    20.5,    20.6,   24.0,  0.00889,      0,      0,       0,       0,       0,       0
total,         90465,    3470,    3470,    3470,    14.5,    20.3,    20.4,    49.8,    85.1,    85.9,   25.0,  0.00855,      0,      0,       0,       0,       0,       0
total,         94108,    3643,    3643,    3643,    13.7,    20.3,    20.3,    20.4,    20.5,    20.7,   26.0,  0.00823,      0,      0,       0,       0,       0,       0
total,         97793,    3685,    3685,    3685,    13.6,    20.3,    20.3,    20.4,    20.5,    20.8,   27.0,  0.00793,      0,      0,       0,       0,       0,       0
total,        101429,    3636,    3636,    3636,    13.7,    20.3,    20.3,    20.4,    20.4,    20.6,   28.0,  0.00765,      0,      0,       0,       0,       0,       0
total,        105117,    3688,    3688,    3688,    13.5,    20.2,    20.3,    20.4,    20.5,    20.7,   29.0,  0.00739,      0,      0,       0,       0,       0,       0
total,        108807,    3690,    3690,    3690,    13.5,    20.2,    20.3,    20.4,    20.5,    20.5,   30.0,  0.00714,      0,      0,       0,       0,       0,       0
total,        109418,    3692,    3692,    3692,    13.6,    20.2,    20.4,    21.6,    22.6,    22.6,   30.2,  0.00825,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :    3,627 op/s  [WRITE: 3,627 op/s]
Partition rate            :    3,627 pk/s  [WRITE: 3,627 pk/s]
Row rate                  :    3,627 row/s [WRITE: 3,627 row/s]
Latency mean              :   13.7 ms [WRITE: 13.7 ms]
Latency median            :   20.3 ms [WRITE: 20.3 ms]
Latency 95th percentile   :   20.3 ms [WRITE: 20.3 ms]
Latency 99th percentile   :   20.4 ms [WRITE: 20.4 ms]
Latency 99.9th percentile :   43.5 ms [WRITE: 43.5 ms]
Latency max               :  116.5 ms [WRITE: 116.5 ms]
Total partitions          :    109,418 [WRITE: 109,418]
Total errors              :          0 [WRITE: 0]
Total GC count            : 0
Total GC memory           : 0.000 KiB
Total GC time             :    0.0 seconds
Avg GC time               :    NaN ms
StdDev GC time            :    0.0 ms
Total operation time      : 00:00:30

END